{"data":{"site":{"pathPrefix":"/restaurant-inspections"},"postgres":{"establishment":[{"establishmentid":"743","name":"Freer Bar","address":"7355 Michigan Ave","zipcode":"4821","owner":"Rosemary Diag","licenseNumber":"034733","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":null,"reviewFrequencyDays":"365.0","coords":"-83.13434,42.33089","geojson":{"id":"743","type":"Feature","geometry":{"type":"Point","coordinates":[-83.134335635,42.3308919500001]},"properties":{"name":"Freer Bar","owner":"Rosemary Diag","address":"7355 Michigan Ave","zipcode":"4821","license_type":"Fixed Establishment","risk_category":null,"license_number":"034733","establishmentid":"743","establishment_type":"Food Service Establishment","establishment_status":"Open","review_frequency_days":"365.0","most_recent_license_date":null}},"nearbyList":[{"establishmentid":"3914","name":"Subway #29822","address":"7300 Michigan Ave","zipcode":"4821"},{"establishmentid":"5348","name":"Hard Bodies Bar","address":"7443 Michigan Ave","zipcode":"4821"},{"establishmentid":"2073","name":"Senor Lopez Taqueria Mexican","address":"7146 Michigan Ave","zipcode":"4821"},{"establishmentid":"715","name":"Yacht Club Exclusive","address":"7059 Michigan Ave","zipcode":"4821"},{"establishmentid":"758","name":"Alaskan Bar Homestead #3","address":"7625 Michigan Ave","zipcode":"4821"},{"establishmentid":"2285","name":"Little Caesar's Pizza","address":"7633 Michigan Ave","zipcode":"4821"},{"establishmentid":"1013","name":"Church's Fried Chicken #302","address":"7060 Michigan Ave","zipcode":"48226"},{"establishmentid":"789","name":"Red Park Inn Bar","address":"4442 Central ","zipcode":"4821"},{"establishmentid":"716","name":"Jordans Family Restaurant","address":"7031 Michigan Ave","zipcode":"4821"},{"establishmentid":"1009","name":"General George Patton Post #11","address":"4930 Central","zipcode":"4821"}],"inspectionsByEstablishmentidList":[{"inspectionid":"45270","inspectionDate":"2019-02-20T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"MFL289.5101","violationDescription":"(1) A person shall not do or cause to be done any of the following:  (a) Manufacture, sell, deliver,  hold, or offer for sale adulterated or misbranded food.    (b) Adulterate or misbrand food.    (c) Receive in commerce food that is adulterated  or misbranded and deliver or proffer the delivery of that food for pay or  otherwise.    (d) Sell, deliver for sale, hold for sale, or  offer for sale food unless that person holds a license issued under chapter IV.    (e) Disseminate a false advertisement concerning food or a food establishment.    (f) Refuse to permit entry or evaluation, or to  permit the taking of a sample, as authorized by section 2111.    (g) Give a false guaranty or undertaking concerning food, unless in good-faith reliance on a guaranty or undertaking to the same effect signed  by and containing the name and address of the person from whom the food was received.    (h) Remove or dispose of seized or embargoed  food in violation of section 2105.    (i) Alter, mutilate, destroy, obliterate, or  remove all or part of the label or do any other act with respect to a food  while the food is held for sale resulting in the food being adulterated or  misbranded.    (j) Forge, counterfeit, simulate, or falsely  represent, or without proper authority use any mark, stamp, tag, label, or  other identification device authorized or required by this act or rules.    (k) Permit filthy or insanitary conditions to  exist in a food establishment in which food intended for human consumption is  manufactured, received, kept, stored, served, sold, or offered for sale.    (l)  Falsely identify a country, state, or other place of origin of food on a label,  tag, or other document with intent to deceive or defraud.    (m) Fail to establish or maintain any record or  make any report required under this act or the federal act, or refuse to permit  access to or verification or copying of any such required record.    (n) Interfere with the director in the conduct  of his or her responsibilities under this act.    (o) Make a false statement, representation, or  certification in any application, report, plan, or other document that is  required to be maintained under this act or rules.    (p) Remove a tag, seal, or mark placed by the  director.    (q) Operate without a license, registration,  permit, or endorsement.    (r) Violate a provision of this act or a rule.    (s) Operate as a shellfish dealer without a shellfish dealer certificate.    (t) If the person is a food establishment, permit Michigan bridge card access to food assistance program benefits unless the food establishment's inventory records match redemption files for Michigan bridge card usage for food assistance program benefits and 1 or more of the following apply:     (i) The food for sale includes, on a continuous basis, at least 3 varieties of foods in each of the following 4 staple food groups and perishable foods in at least 2 of the groups:      (A) Meat, poultry, or fish.      (B) Bread or cereal.     (C)   Vegetables or fruits.     (D) Dairy products.     (ii) At least 50% of the total dollar amount of all retail sales, including food and nonfood items, fuel, and services at the food establishment is from the sale of food in any of the 4 staple food groups.  (2) Each day a violation of this section occurs is a separate violation of this section.      ","violationType":"Priority","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"ENTIRE FACILITY","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"A Person in Charge is required to be present during all hours of operation."},{"violationCode":"8-402.11","violationDescription":"After the REGULATORY AUTHORITY presents official credentials and provides notice of the purpose of, and an intent to conduct, an inspection, the PERSON IN CHARGE shall allow the REGULATORY AUTHORITY to determine if the FOOD ESTABLISHMENT is in compliance with this Code by allowing access to the establishment, allowing inspection, and providing information and records specified in this Code and to which the REGULATORY AUTHORITY is entitled according to LAW, during the FOOD ESTABLISHMENT'S hours of operation and other reasonable times.","violationType":"Core","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"ESTABLISHMENT","subLocation":"Entire facility","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"A Person in Charge is required to be present during all hours of operation."}]},{"inspectionid":"38432","inspectionDate":"2017-03-15T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[{"violationCode":"5-501.17","violationDescription":"A toilet room used by females shall be provided with a covered receptacle for sanitary napkins.\r\n","violationType":"Core","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":null}]}]}],"maxInspectionDate":[{"inspectionDate":"2019-04-30T00:00:00"}]}},"pageContext":{"eid":"743"}}