{"data":{"postgres":{"establishment":[{"establishmentid":"3387","name":"Jimmy Johns","address":"95 Monroe St","owner":"Cliff Lunney","licenseNumber":"054616","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":null,"reviewFrequencyDays":"365.0","inspectionsByEstablishmentidList":[{"inspectionid":"42942","inspectionDate":"2018-07-05T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"4-602.11","violationDescription":"(A) Equipment FOOD-CONTACT SURFACES and UTENSILS shall be cleaned:     \r\n  (1) Except as specified in ¶ (B) of this section, before each use with a different   type of raw animal FOOD such as beef, FISH, lamb, pork, or POULTRY; (P)   \r\n  (2) Each time there is a change from working with raw FOODS to working with   READY-TO-EAT FOODS; (P)   \r\n  (3) Between uses with raw fruits and vegetables and with POTENTIALLY   HAZARDOUS FOOD (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD);   (P)   \r\n  (4) Before using or storing a FOOD TEMPERATURE MEASURING   DEVICE; (P) and   \r\n  (5) At any time during the operation when contamination may have occurred. (P)\r\n(B) Subparagraph (A)(1) of this section does not apply if the FOOD-CONTACT SURFACE or UTENSIL is in contact with a succession of different raw animal FOODS each requiring a higher cooking temperature as specified under § 3-401.11 than the previous FOOD, such as preparing raw FISH followed by cutting raw poultry on the same cutting board.   \r\n(C) Except as specified in ¶ (D) of this section, if used with POTENTIALLY HAZARDOUS FOOD (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD), EQUIPMENT FOOD-CONTACT SURFACES and UTENSILS shall be cleaned throughout the day at least every 4 hours. (P)   \r\n(D) Except when dry cleaning methods are used as specified under § 4-603.11, surfaces of UTENSILS and EQUIPMENT contacting FOOD that is not POTENTIALLY HAZARDOUS (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD) shall be cleaned:     \r\n  (1)   At any time when contamination may have occurred;\r\n  (2)   At least every 24 hours for iced tea dispensers and CONSUMER self-service UTENSILS such as tongs, scoops, or ladles;\r\n  (3) Before restocking CONSUMER self-service EQUIPMENT and UTENSILS such as condiment dispensers and display containers; and\r\n  (4) In EQUIPMENT such as ice bins and BEVERAGE dispensing nozzles and   enclosed components of EQUIPMENT such as ice makers, cooking oil storage   tanks and distribution lines, BEVERAGE and syrup dispensing lines or tubes,   coffee bean grinders, and water vending EQUIPMENT:\r\n     (a) At a frequency specified by the manufacturer, or\r\n     (b) Absent manufacturer specifications, at a frequency necessary to preclude      accumulation of soil or mold.","violationType":"Priority","itemDescription":"Food-contact surface(s) used for nonpotentially hazardous food(s)","subItem":"","problemDescription":"Not cleaned when contaminated","subProblem":"","location":"KITCHEN","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Clean properly when contaminated."},{"violationCode":"3-501.16","violationDescription":"Except during preparation, cooking, or cooling, or when time is used as the public health control POTENTIALLY HAZARDOUS FOOD (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD) shall be maintained:\r\n(A)  135ºF or above, except that roasts properly cooked and cooled may be held              at a temperature of 130ºF; or (P)\r\n(B)   At 41ºF or less (P)\r\n","violationType":"Priority","itemDescription":"Cold food item(s)","subItem":"","problemDescription":"Stored above 41 degrees F","subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2018-07-05T00:00:00","correctionDescription":"Store below 41 degrees F."},{"violationCode":"3-304.12","violationDescription":"During pauses in FOOD preparation or dispensing, UTENSILS shall be stored:\r\n(A) In the FOOD with their handles above the top of the FOOD and the container;\r\n(B) In FOOD that is not POTENTIALLY HAZARDOUS with their handles above the      top of the FOOD within containers or EQUIPMENT that can be closed, such as      bins of sugar, flour, or cinnamon;\r\n(C) On a clean portion of the FOOD preparation table or cooking EQUIPMENT\r\n(D)  In running water, such as dipper well.\r\n(E)  In a clean, protected location if the UTENSILS, such as ice scoops, are   used only with a FOOD that is not POTENTIALLY HAZARDOUS; or\r\n(F)  In a container of water maintained at a temperature of at least 135° F.\r\n","violationType":"Core","itemDescription":"Dispensing utensil(s)","subItem":"","problemDescription":"Improperly stored","subProblem":"In water less than 135 degrees f","location":"KITCHEN","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Maintain water at 135 degrees F or greater."},{"violationCode":"4-501.11","violationDescription":"EQUIPMENT shall be maintained in a state of repair and condition that meets the requirements of the code.\r\n","violationType":"Core","itemDescription":"Equipment","subItem":"","problemDescription":"In poor repair","subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Repair"}]},{"inspectionid":"39028","inspectionDate":"2017-06-16T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[]}]}]}},"pageContext":{"eid":"3387"}}