{"data":{"site":{"pathPrefix":"/restaurant-inspections"},"postgres":{"establishment":[{"establishmentid":"4414","name":"Saucebar","address":"15838 W Seven Mile Rd","zipcode":"48235","owner":"Bolden Corporation","licenseNumber":"073385","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":null,"reviewFrequencyDays":"180.0","coords":"-83.20358,42.43061","geojson":{"id":"4414","type":"Feature","geometry":{"type":"Point","coordinates":[-83.203584978,42.4306108210001]},"properties":{"name":"Saucebar","owner":"Bolden Corporation","address":"15838 W Seven Mile Rd","zipcode":"48235","license_type":"Fixed Establishment","risk_category":null,"license_number":"073385","establishmentid":"4414","establishment_type":"Food Service Establishment","establishment_status":"Open","review_frequency_days":"180.0","most_recent_license_date":null}},"nearbyList":[{"establishmentid":"5009","name":"Uncle Big John's Fresh Fish Mkt.","address":"15834 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"3537","name":"Fat Boyz Steak and Chicken","address":"15917 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"1475","name":"Burger King ","address":"15500 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"1179","name":"Nicky D's Coney Island","address":"15447 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"4998","name":"Encore Lounge and Grill","address":"15407 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"4974","name":"Motor City Sweet Shop","address":"16311 W Seven Mile Rd","zipcode":"48235"},{"establishmentid":"1118","name":"Bow Elementary School","address":"19801 Prevost Ave","zipcode":"48235"},{"establishmentid":"2037","name":"Michigan Technical Academy","address":"19940 Mansfield Ave","zipcode":"48235"},{"establishmentid":"51622825","name":"Pembroke Academy","address":"19940 Mansfield St","zipcode":"48235"},{"establishmentid":"1131","name":"Clara Rutherford/Winans Academy","address":"16411 Curtis Ave","zipcode":"48235"}],"inspectionsByEstablishmentidList":[{"inspectionid":"44817","inspectionDate":"2019-01-08T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"2-102.11","violationDescription":"The PERSON IN CHARGE shall demonstrate this knowledge by compliance with this Code, by being a certified FOOD protection manager who has shown proficiency of required information through passing a test that is part of an ACCREDITED PROGRAM, or by responding correctly to the inspector's questions as they relate to the specific FOOD operation. (Pf)","violationType":"Foundation","itemDescription":"Person-in-charge","subItem":"","problemDescription":"Does not demonstrate required knowledge","subProblem":"","location":"RESTAURANT","subLocation":"Throughout Facility","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Knowledge is to be obtained through an approved training program."},{"violationCode":"8-304.11","violationDescription":"Upon acceptance of the PERMIT issued by the REGULATORY AUTHORITY, the PERMIT HOLDER in order to retain the PERMIT shall:\r\n(A) Post the PERMIT in a location in the FOOD ESTABLISHMENT that is conspicuous to CONSUMERS; \r\n(B) Comply with the provisions of this Code including the conditions of a granted VARIANCE as specified under § 8-103.12, and APPROVED plans as specified under § 8-201.12;\r\n(C) If a FOOD ESTABLISHMENT is required under § 8-201.13 to operate under a HACCP PLAN, comply with the plan as specified under § 8-103.12;\r\n(D) Immediately contact the REGULATORY AUTHORITY to report an illness of a FOOD EMPLOYEE or CONDITIONAL EMPLOYEE as specified under ¶ 2-201.11(B); \r\n(E) Immediately discontinue operations and notify the REGULATORY AUTHORITY if an IMMINENT HEALTH HAZARD may exist as specified under § 8-404.11;\r\n(F) Allow representatives of the REGULATORY AUTHORITY access to the FOOD ESTABLISHMENT as specified under § 8-402.11;\r\n(G) Except as specified under ¶ (H) of this section, replace existing facilities and EQUIPMENT specified in § 8-101.10 with facilities and EQUIPMENT that comply with this Code if:\r\n(1) The REGULATORY AUTHORITY directs the replacement because the facilities and EQUIPMENT constitute a public health HAZARD or nuisance or no longer comply with the criteria upon which the facilities and EQUIPMENT were accepted,\r\n(2) The REGULATORY AUTHORITY directs the replacement of the facilities and EQUIPMENT because of a change of ownership, or\r\n(3) The facilities and EQUIPMENT are replaced in the normal course of operation;\r\n(H) Upgrade or replace refrigeration EQUIPMENT as specified under Subparagraph 3-501.16(A)(2)(b), if the circumstances specified under Subparagraphs (G)(1) - (3) of this section do not occur first, and 5 years pass after the REGULATORY AUTHORITY adopts this Code;\r\n(I) Comply with directives of the REGULATORY AUTHORITY including time frames for corrective actions specified in inspection reports, notices, orders, warnings, and other directives issued by the REGULATORY AUTHORITY in regard to the PERMIT HOLDER'S FOOD ESTABLISHMENT or in response to community emergencies; \r\n(J) Accept notices issued and served by the REGULATORY AUTHORITY according to LAW; and \r\n(K) Be subject to the administrative, civil, injunctive, and criminal remedies authorized in LAW for failure to comply with this Code or a directive of the REGULATORY AUTHORITY, including time frames for corrective actions specified in inspection reports, notices, orders, warnings, and other directives.","violationType":"Core","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"RESTAURANT","subLocation":"Throughout Facility","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"A Person in Charge is required to be present during all hours of operation."}]},{"inspectionid":"40557","inspectionDate":"2017-10-24T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[]},{"inspectionid":"38195","inspectionDate":"2017-02-22T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[{"violationCode":"3-603.11","violationDescription":"If an animal FOOD such as  beef, EGGS, FISH, lamb, milk, pork, POULTRY, or shellfish is served or sold raw, undercooked, or without otherwise being processed to eliminate pathogens, either in a READY-TO-EAT form or as an ingredient in another READY-TO-EAT FOOD, the PERMIT HOLDER shall inform CONSUMERS of the significantly increased RISK of consuming such FOODS, by using menu advisories, brochures, lable statements, table tents, placards, or other effective written means. (Pf)\r\nFOOD LAW SEC 6149\r\n...The food establishment may provide the following statement on selection information so that it is made pulblicly available: \"Ask your server about menu items that are cooked to order or served raw.  Consuming raw or undercooked, meats, poultry, shellfish, or eggs may increase your risk of foodborne illness.\"\r\nThe statements must be in a minimum of 11 point font and in a color that provides a clear contrast to background.\r\n","violationType":"Foundation","itemDescription":"Menu advisories","subItem":"","problemDescription":"Not provided","subProblem":"","location":"MENU(S)","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2017-02-22T00:00:00","correctionDescription":"Provide as required"},{"violationCode":"6-301.14","violationDescription":"A sign or poster that notifies FOOD EMPLOYEES to wash their hands shall be provided at all HANDWASHING SINKS used by FOOD EMPLOYEES and shall be clearly visible to FOOD EMPLOYEES.\r\n","violationType":"Core","itemDescription":"Handwashing signage","subItem":"","problemDescription":"Not provided","subProblem":"","location":"RESTROOM (EMPLOYEE)","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide as required"},{"violationCode":"MFL289.2129","violationDescription":"Sec. 2129. (1) All of the following food establishments shall employ a minimum of 1 managerial employee who is currently certified under a personnel certification program accredited by the American national standards institute, utilizing the conference for food protection standards:  (a) A food service establishment that is not any of the following:    (i) Operating under a temporary food service establishment license.  (ii) A vending machine location.     (b) An extended retail food establishment.  (c) Operated within a retail grocery.  (2) An individual certified under subsection (1) shall be recognized with full faith and credit by the state and all local units of government throughout the state.  (3) The department may promulgate rules to do all of the following:  (a) Develop requirements for retail food establishments to follow when employing certified food safety managers or personnel.  (b) Set a reasonable date for compliance with the requirements under subdivision (a) taking into consideration existing local personnel certification requirements.  (c) Establish certification fees necessary to implement, maintain, and track certified individuals directly or by contract. The department may annually adjust the schedule of fees to provide that the fee charged is sufficient to cover the cost of the certification tracking program.  (d) Implement and enforce the requirements described in subdivision (a).    (4) The certification program developed by the American national standards institute, as it exists on April 1, 2008 , is incorporated by reference. The department may adopt updates to the certification program accreditation standards in subsection (1) by rule.     (5) This section does not prohibit any local legislative body from implementing a food handler program, an employee health certification program, or a manager certification program, if it is not in conflict with this section.","violationType":"Core","itemDescription":"Person-in-charge","subItem":"","problemDescription":"Missing","subProblem":"","location":"FACILITY","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide."}]}]}]}},"pageContext":{"eid":"4414"}}