{"data":{"postgres":{"establishment":[{"establishmentid":"605","name":"Two Way Inn","address":"17897 Mt Elliott St","zipcode":"48212","owner":"Mary R. Aganowski","licenseNumber":"049405","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":null,"reviewFrequencyDays":"365.0","coords":"-83.03894,42.42626","geojson":{"id":"605","type":"Feature","geometry":{"type":"Point","coordinates":[-83.038940617,42.4262551460001]},"properties":{"name":"Two Way Inn","owner":"Mary R. Aganowski","address":"17897 Mt Elliott St","zipcode":"48212","license_type":"Fixed Establishment","risk_category":null,"license_number":"049405","establishmentid":"605","establishment_type":"Food Service Establishment","establishment_status":"Open","review_frequency_days":"365.0","most_recent_license_date":"4/28/2017"}},"nearbyList":[{"establishmentid":"560","name":"Tippin Inn, Inc.","address":"18430-34 Mt Elliott"},{"establishmentid":"550","name":"Pandora's Boxx, LLC","address":"6221 E Davison Ave"},{"establishmentid":"629","name":"V.F.W. Post #2233 James Europe","address":"18651 Mound Rd"},{"establishmentid":"302","name":"Original Marcus Hamburger","address":"6349 E McNichols Rd"},{"establishmentid":"361","name":"Brandy's on 7","address":"6141 E Seven Mile Rd"}],"inspectionsByEstablishmentidList":[{"inspectionid":"41440","inspectionDate":"2018-02-08T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[{"violationCode":"7-201.11","violationDescription":"POISONOUS OR TOXIC MATERIAL shall be stored so they can not contaminate FOOD, EQUIPMENT, UTENSILS, LINENS, AND SINGLE-SERVICE AND SINGLE-USE ARTICLES by:   \r\n(A) Separating the POISONOUS OR TOXIC MATERIAL by spacing or partitioning; (P) and   \r\n(B) Locating the POISONOUS OR TOXIC MATERIAL in an area that is not above FOOD, EQUIPMENT, UTENSILS, LINENS, AND SINGLE-SERVICE AND SINGLE-USE ARTICLES.  This paragraph does not apply to EQUIPMENT and UTENSIL cleaners and sanitizers that are stored in WAREWASHING areas for availability and convenience if the materials are stored to prevent contamination of FOOD, EQUIPMENT, UTENSILS, LINENS, AND SINGLE-SERVICE and SINGLE-USE ARTICLES. (P)","violationType":"Priority","itemDescription":"Poisonous/toxic material(s)","subItem":"","problemDescription":"Not separated from","subProblem":"","location":"MICROWAVE","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2018-02-08T00:00:00","correctionDescription":"Relocate."}]},{"inspectionid":"38256","inspectionDate":"2017-02-17T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[{"violationCode":"MFL289.2129","violationDescription":"Sec. 2129. (1) All of the following food establishments shall employ a minimum of 1 managerial employee who is currently certified under a personnel certification program accredited by the American national standards institute, utilizing the conference for food protection standards:  (a) A food service establishment that is not any of the following:    (i) Operating under a temporary food service establishment license.  (ii) A vending machine location.     (b) An extended retail food establishment.  (c) Operated within a retail grocery.  (2) An individual certified under subsection (1) shall be recognized with full faith and credit by the state and all local units of government throughout the state.  (3) The department may promulgate rules to do all of the following:  (a) Develop requirements for retail food establishments to follow when employing certified food safety managers or personnel.  (b) Set a reasonable date for compliance with the requirements under subdivision (a) taking into consideration existing local personnel certification requirements.  (c) Establish certification fees necessary to implement, maintain, and track certified individuals directly or by contract. The department may annually adjust the schedule of fees to provide that the fee charged is sufficient to cover the cost of the certification tracking program.  (d) Implement and enforce the requirements described in subdivision (a).    (4) The certification program developed by the American national standards institute, as it exists on April 1, 2008 , is incorporated by reference. The department may adopt updates to the certification program accreditation standards in subsection (1) by rule.     (5) This section does not prohibit any local legislative body from implementing a food handler program, an employee health certification program, or a manager certification program, if it is not in conflict with this section.","violationType":"Core","itemDescription":"Person-in-charge","subItem":"","problemDescription":"Failed to notify the health department that an employee is diagnosed with a \"big 4\" illness","subProblem":"","location":"FACILITY","subLocation":"At the Certified Manager","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide"}]}]}]}},"pageContext":{"eid":"605"}}