{"data":{"postgres":{"establishment":[{"establishmentid":"643","name":"UAW Local Union #1700","address":"8230 E Eight Mile Rd","zipcode":"48234","owner":"UAW Local Union #1700","licenseNumber":"034556","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":"Low","reviewFrequencyDays":"530.0","coords":"-83.02082,42.44798","geojson":{"id":"643","type":"Feature","geometry":{"type":"Point","coordinates":[-83.0208171799999,42.447981467]},"properties":{"name":"UAW Local Union #1700","owner":"UAW Local Union #1700","address":"8230 E Eight Mile Rd","zipcode":"48234","license_type":"Fixed Establishment","risk_category":"Low","license_number":"034556","establishmentid":"643","establishment_type":"Food Service Establishment","establishment_status":"Open","review_frequency_days":"530.0","most_recent_license_date":"4/26/2016"}},"nearbyList":[{"establishmentid":"51622683","name":"Detroit Grill & Deli","address":"20216 Van Dyke Ave","zipcode":"48234"},{"establishmentid":"5335","name":"Great Lakes Fish & Chicken Market","address":"20445 VanDyke St","zipcode":"48234"},{"establishmentid":"51622743","name":"Diamond Hospitality LLC","address":"4777 E Outer Drive","zipcode":"48234"},{"establishmentid":"1478","name":"Nortown Dairy Bar","address":"20018 Van Dyke Ave","zipcode":"48234"},{"establishmentid":"763","name":"Bel Air 10 Theater","address":"10100 E Eight Mile Rd","zipcode":"48234"}],"inspectionsByEstablishmentidList":[{"inspectionid":"40532","inspectionDate":"2017-10-19T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"7-202.12","violationDescription":"POISONOUS OR TOXIC MATERIALS shall be:    \r\n(A) Used according to:      \r\n(1) LAW and this Code,   \r\n(2) Manufacturer's use directions included in labeling, and, for a pesticide, manufacturer's label instructions that state that use is allowed in a FOOD ESTABLISHMENT, (P)   \r\n(3) The conditions of certification, if certification is required, for use of the pest control materials, (P) and   \r\n(4) Additional conditions that may be established by the REGULATORY AUTHORITY; and\r\n(B) Applied so that:      \r\n(1) A HAZARD to EMPLOYEES or other PERSONS is not constituted, (P) and   \r\n(2) Contamination including toxic residues due to drip, drain, fog, splash or spray on FOOD, EQUIPMENT, UTENSILS, LINENS, AND SINGLE-SERVICE AND SINGLE-USE ARTICLES is prevented, and for a RESTRICTED USE PESTICIDE, this is achieved by: (P)      \r\n(a) Removing the items, (P)   \r\n(b) Covering the items with impermeable covers, (P) or   \r\n(c) Taking other appropriate preventive actions, (P) and   \r\n(d) Cleaning and SANITIZING EQUIPMENT and UTENSILS after the application. (P)  \r\n(C) A RESTRICTED USE PESTICIDE shall be applied only by an applicator certified as defined in 7 USC 136 Definitions, (e) Certified Applicator, of the Federal Insecticide, Fungicide, and Rodenticide Act, or a PERSON under the direct supervision of a certified applicator. (Pf)","violationType":"Priority","itemDescription":"Poisonous/toxic material(s)","subItem":"","problemDescription":"Creates public health hazard or nuisance","subProblem":"","location":"KITCHEN","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Discontinue use and relocate."},{"violationCode":"6-301.14","violationDescription":"A sign or poster that notifies FOOD EMPLOYEES to wash their hands shall be provided at all HANDWASHING SINKS used by FOOD EMPLOYEES and shall be clearly visible to FOOD EMPLOYEES.\r\n","violationType":"Core","itemDescription":"Handwashing signage","subItem":"","problemDescription":"Not provided","subProblem":"","location":"HANDSINK(S)","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide."},{"violationCode":"MFL289.2129","violationDescription":"Sec. 2129. (1) All of the following food establishments shall employ a minimum of 1 managerial employee who is currently certified under a personnel certification program accredited by the American national standards institute, utilizing the conference for food protection standards:  (a) A food service establishment that is not any of the following:    (i) Operating under a temporary food service establishment license.  (ii) A vending machine location.     (b) An extended retail food establishment.  (c) Operated within a retail grocery.  (2) An individual certified under subsection (1) shall be recognized with full faith and credit by the state and all local units of government throughout the state.  (3) The department may promulgate rules to do all of the following:  (a) Develop requirements for retail food establishments to follow when employing certified food safety managers or personnel.  (b) Set a reasonable date for compliance with the requirements under subdivision (a) taking into consideration existing local personnel certification requirements.  (c) Establish certification fees necessary to implement, maintain, and track certified individuals directly or by contract. The department may annually adjust the schedule of fees to provide that the fee charged is sufficient to cover the cost of the certification tracking program.  (d) Implement and enforce the requirements described in subdivision (a).    (4) The certification program developed by the American national standards institute, as it exists on April 1, 2008 , is incorporated by reference. The department may adopt updates to the certification program accreditation standards in subsection (1) by rule.     (5) This section does not prohibit any local legislative body from implementing a food handler program, an employee health certification program, or a manager certification program, if it is not in conflict with this section.","violationType":"Core","itemDescription":"Person-in-charge","subItem":"","problemDescription":"Missing","subProblem":"","location":"PERSON IN CHARGE","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide."}]}]}]}},"pageContext":{"eid":"643"}}