{"data":{"postgres":{"establishment":[{"establishmentid":"1632","name":"Taqueria Lupitas","address":"3443 Bagley","owner":"ADAN LOPEZ","licenseNumber":"035960","licenseType":"Fixed Establishment","establishmentType":"Food Service Establishment","establishmentStatus":"Open","riskCategory":null,"reviewFrequencyDays":"180.0","inspectionsByEstablishmentidList":[{"inspectionid":"44022","inspectionDate":"2018-11-01T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"3-301.11","violationDescription":"(A) To prevent food contamination FOOD EMPLOYEES shall properly wash their      hands.\r\n(B) FOOD EMPLOYEES may not contact exposed, READY-TO-EAT FOOD with      their bare hands and shall use suitable UTENSILS such as deli tissue,       spatulas, tongs, single-use gloves, or dispensing EQUIPMENT. (P)\r\n(C) FOOD EMPLOYEES shall minimize bare hand and arm contact with exposed     FOOD that is not in a READY-TO-EAT form. (Pf)\r\n\r\n","violationType":"Priority","itemDescription":"Ready-to-eat food(s)","subItem":"","problemDescription":"Handled with bare hands","subProblem":"","location":"COOK LINE AREA","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2018-11-01T00:00:00","correctionDescription":"Suitable utensils or single-use gloves are to be utilized."},{"violationCode":"4-501.114","violationDescription":"A chemical SANITIZER used in a SANITIZING solution for a manual or\r\nmechanical operation shall meet these limits or as otherwise approved: (P)\r\n\tChlorine        ppm           pH<10             pH<8\r\n\t\t      25              120 F              120 F\r\n\t\t      50              100 F              75 F\r\n\t\t     100              55 F               55 F\r\n                 Iodine           a concentration of between 12.5 and 25 ppm and minimum temp of 75 F and pH of 5 or less or meets manufacturer's specifications. (P)\r\n\r\n                Quats            minimum temperature of 75 F, hardness of 500 ppm or less and meet manufacturers use directions. (P)\r\n","violationType":"Priority","itemDescription":"Chlorine solution concentration","subItem":"","problemDescription":"Below 25 ppm","subProblem":"","location":"DISHWASHING AREA","subLocation":"Dishwasher","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2018-11-01T00:00:00","correctionDescription":"Provide correct concentration as stated above."},{"violationCode":"4-302.14","violationDescription":"A test kit or other device that accurately measures the concentration in mg/L of SANITIZING solutions shall be provided. (Pf)\r\n","violationType":"Foundation","itemDescription":"Sanitizer test kit","subItem":"","problemDescription":"Not provided","subProblem":"","location":"DISHWASHING AREA","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Provide as required"},{"violationCode":"6-202.11","violationDescription":"Except as otherwise approved, light bulbs shall be shielded, coated, or otherwise shatter-resistant in areas where there is exposed FOOD; clean EQUIPMENT, UTENSILS, and LINENS; or unwrapped SINGLE-SERVICE and SINGLE-USE ARTICLES.\r\n","violationType":"Core","itemDescription":"Light shielding","subItem":"","problemDescription":"Missing","subProblem":"","location":"KEG ROOM","subLocation":"At the Light Shield(s)","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide."},{"violationCode":"5-501.17","violationDescription":"A toilet room used by females shall be provided with a covered receptacle for sanitary napkins.\r\n","violationType":"Core","itemDescription":"Covered waste receptacle(s)","subItem":"","problemDescription":"Not provided","subProblem":"","location":"RESTROOM (WOMEN'S)","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":"Provide as required"},{"violationCode":"MFL289.2129","violationDescription":"Sec. 2129. (1) All of the following food establishments shall employ a minimum of 1 managerial employee who is currently certified under a personnel certification program accredited by the American national standards institute, utilizing the conference for food protection standards:  (a) A food service establishment that is not any of the following:    (i) Operating under a temporary food service establishment license.  (ii) A vending machine location.     (b) An extended retail food establishment.  (c) Operated within a retail grocery.  (2) An individual certified under subsection (1) shall be recognized with full faith and credit by the state and all local units of government throughout the state.  (3) The department may promulgate rules to do all of the following:  (a) Develop requirements for retail food establishments to follow when employing certified food safety managers or personnel.  (b) Set a reasonable date for compliance with the requirements under subdivision (a) taking into consideration existing local personnel certification requirements.  (c) Establish certification fees necessary to implement, maintain, and track certified individuals directly or by contract. The department may annually adjust the schedule of fees to provide that the fee charged is sufficient to cover the cost of the certification tracking program.  (d) Implement and enforce the requirements described in subdivision (a).    (4) The certification program developed by the American national standards institute, as it exists on April 1, 2008 , is incorporated by reference. The department may adopt updates to the certification program accreditation standards in subsection (1) by rule.     (5) This section does not prohibit any local legislative body from implementing a food handler program, an employee health certification program, or a manager certification program, if it is not in conflict with this section.","violationType":"Core","itemDescription":"Person-in-charge","subItem":"","problemDescription":null,"subProblem":"","location":"ESTABLISHMENT","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":null},{"violationCode":"5-205.15","violationDescription":"A PLUMBING SYSTEM shall be:\r\n(A) Repaired according to LAW; (P) and\r\n(B) Maintained in good repair.\r\n","violationType":"Core","itemDescription":"Drainage system","subItem":"drain lines","problemDescription":null,"subProblem":"","location":"HANDSINK(S)","subLocation":"By the Three compartment sink","corrected":"Not required","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":null},{"violationCode":"6-501.11","violationDescription":"PHYSICAL FACILITIES shall be maintained in good repair.\r\n","violationType":"Core","itemDescription":"Physical facilities","subItem":"","problemDescription":"In poor repair","subProblem":"","location":"KITCHEN","subLocation":"At the Ceiling (s)","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":null}]},{"inspectionid":"39743","inspectionDate":"2017-08-30T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"MFL285.569.1","violationDescription":"Rule 1. (1) As used in these rules:  (a)   \"Cold process smoked fish\" means a smoked  fish  that  has  not  been subjected to sufficient heat to coagulate the protein throughout the fish.  (b)   \"Critical control point\" means a point, step, or procedure in a  food process at which control can be applied and,  as  a  result,  a  food  safety hazard can be prevented, eliminated, or reduced to acceptable levels.  (c)   \"Critical limit\" means the  maximum  or  minimum  value  to  which  a physical, biological, or chemical parameter must be controlled at a  critical control point to prevent, eliminate, or reduce to  an  acceptable  level  the occurrence of the identified food safety hazard.  (d)    \"Fish\"  means  all  freshwater  or  saltwater   finfish,   mollusks, crustaceans, and other aquatic organisms, other than birds or  mammals,  that are intended for human consumption.  (e)   \"Fish product\" means  any  article  of  food  or  any  other  article intended for, or capable of being used as, human  food  that  is  derived  or prepared, in whole or in part, from any portion of any fish.  (f)   \"Hazard analysis and critical control point  (HACCP)  plan\"  means  a food processing plan under which a food processing plant operator effectively prevents food safety hazards by monitoring food safety variables at  critical control points and by controlling the variables within critical limits.  (g)   \"Hot process smoked fish\" means a smoked fish that has been subjected to sufficient heat for a sufficient period of time to coagulate  the  protein throughout the fish.  (h)   \"Liquid smoke\" means an aqueous solution of  wood  smoke  that,  when suitably diluted, may be used to impart a smoke flavor.  (i)   \"Loin muscle\" means the longitudinal quarter  of  the  great  lateral muscle of the fish that is free  from  skin,  scales,  visible  blood  clots, bones, gills, and nonstriated parts.  (j)   \"Process authority\" means a person who has expert  knowledge  of  the commercial processing of fish and fishery products based on a combination  of education, training, and experience.   (k)  \"Reduced oxygen packaging\" means packaging that reduces the amount of oxygen in a package by mechanical evacuation of the  oxygen,  displacing  the oxygen with another gas or combination of gases, or otherwise controlling the oxygen content in a package to a level below the level of 21% normally  found in the surrounding atmosphere. \"Reduced oxygen  packaging\"  includes  altered atmosphere, modified atmosphere, controlled atmosphere, low oxygen and vacuum packaging.  (l)   \"Smoked fish\"  means  a  freshwater  or  saltwater  finfish  that  is prepared by treating it with salt (sodium chloride) and subjecting it to  the direct action of the smoke  from  burning  wood,  wood  sawdust,  or  similar burning material or from liquid smoke flavoring applied to the surface  in  a gaseous, liquid, or vaporized state with or without heat.  The term  includes products composed in whole or in part from  smoked  fish,  such  as  sausage, pate, or snack dip.  (m) \"Temperature-indicating device\" means an accurate, standard thermometer or equivalent device, such as a resistance temperature device or thermocouple.  (n) \"Temperature-recording device\"  means  a  device  that  is  capable  of providing a continuous record of the temperature conditions being monitored.  (o)   \"Water phase salt\" means the percentage of salt (sodium chloride)  in the  water  phase  of  the  finished  fish  product.   It  is  calculated  by multiplying the percentage of salt (sodium chloride) by 100 and dividing that number by the sm  of  the  percentage  of  salt  (sodium  chloride)  and  the percentage of moisture in the finished product.  Moisture  and  salt  content shall  be  determined  in  accordance  with  the  method  described  in   the publication entitled \"Official Methods of Analysis of   AOAC,  International\" 16th edition.  The publication is adopted in these rules by reference and may be obtained from AOAC, International, 2200 Wilson  Boulevard,  Suite  400-GG, Arlington, Virginia 22207-3301, at a cost as of the time of adoption of these rules of $359.00 (print version), or from the Department of Agriculture, Food Division, Ottawa Building, Fourth Floor, P.O. Box 30017, Lansing, MI 4 48909, at cost.  (2)   Terms defined in Act No. 39 of the Public Acts of 1968,  as  amended, being ยง289.701 et seq. of the Michigan Compiled Laws, have the same  meanings when used in these rules.  History:  1997 AACS.","violationType":"Priority","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"ESTABLISHMENT","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Knowledge is to be obtained through an approved training program"},{"violationCode":"4-702.11","violationDescription":"UTENSILS and FOOD-CONTACT SURFACES of EQUIPMENT shall be SANITIZED before use after cleaning. (P)\r\n","violationType":"Priority","itemDescription":"Clean utensil(s) and food-contact surface(s)","subItem":"","problemDescription":"Not sanitized","subProblem":"","location":"DISHWASHING AREA","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2017-08-30T00:00:00","correctionDescription":"Sanitize as required above."},{"violationCode":"3-302.11","violationDescription":"(A) FOOD shall be protected from cross contamination by:  \r\n(1) Except as specified in (1)(c) below, separating raw animal FOODS during         storage, preparation, holding, and display from:\r\n(a) Raw READY-TO-EAT FOOD including other raw animal FOOD such as FISH for sushi or MOLLUSCAN SHELLFISH, or other raw READY-TO-EAT FOOD such as fruits and vegetables,(P) and\r\n(b) Cooked READY-TO-EAT FOOD; (P)\r\n(c) Frozen, commercially processed and packaged raw animal FOOD may be          stored or displayed with or above frozen, commercially processed and           packaged, ready-to-eat food.\r\n(2) Except when combined as ingredients, separating types of raw animal FOODS    from each other such as beef, FISH, lamb, pork, and POULTRY during storage,        preparation, holding, and display by:\r\n(a) Using separate EQUIPMENT for each type, (P) or\r\n(b) Arranging each type of FOOD in EQUIPMENT so that cross contamination of one type with another is prevented, (P) and\r\n(c) Preparing each type of FOOD at different times or in separate areas; (P)\r\n","violationType":"Priority","itemDescription":"Raw animal food(s)","subItem":"","problemDescription":"Stored over/next to","subProblem":"Ready-to-eat food(s)","location":"WALK-IN COOLER","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2017-08-30T00:00:00","correctionDescription":"Store raw animal foods below and away from foods needing little or no further prep."},{"violationCode":"3-501.17","violationDescription":"(A)  READY-TO-EAT, POTENTIALLY HAZARDOUS FOOD (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD)  prepared and held refrigerated for more than 24 hours in a FOOD ESTABLISHMENT  shall be clearly marked at the time of preparation to indicate the date or day by which the FOOD shall be consumed. (Pf)\r\n(B)  A container of refrigerated, commercially prepared READY-TO-EAT POTENTIALLY HAZARDOUS FOOD (TIME/TEMPERATURE CONTROL FOR SAFETY FOOD)  shall be clearly marked, at the time the original container is opened in a FOOD ESTABLISHMENT, to indicate the date or day by which the FOOD shall be consumed. (Pf)\r\n\r\nA date marking system that does not exceed 7 days, including date of preparation, or opening is to be used. (Pf)\r\n","violationType":"Foundation","itemDescription":"In house prepared ready-to-eat potentially hazardous  food(s)","subItem":"","problemDescription":"Without date of consumption marking","subProblem":"","location":"WALK-IN COOLER","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Establishment shall provide a clear date marking system."},{"violationCode":"2-102.11","violationDescription":"The PERSON IN CHARGE shall demonstrate this knowledge by compliance with this Code, by being a certified FOOD protection manager who has shown proficiency of required information through passing a test that is part of an ACCREDITED PROGRAM, or by responding correctly to the inspector's questions as they relate to the specific FOOD operation. (Pf)","violationType":"Foundation","itemDescription":"Person-in-charge","subItem":"","problemDescription":"Not ensuring compliance","subProblem":"","location":"ESTABLISHMENT","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":"Knowledge is to be obtained through an approved training program"}]},{"inspectionid":"39205","inspectionDate":"2017-05-01T00:00:00","inspectionType":"Complaint","inCompliance":"Yes","violationsByInspectionidList":[]},{"inspectionid":"38093","inspectionDate":"2017-02-15T00:00:00","inspectionType":"Routine Inspection","inCompliance":"No","violationsByInspectionidList":[{"violationCode":"3-302.11","violationDescription":"(A) FOOD shall be protected from cross contamination by:  \r\n(1) Except as specified in (1)(c) below, separating raw animal FOODS during         storage, preparation, holding, and display from:\r\n(a) Raw READY-TO-EAT FOOD including other raw animal FOOD such as FISH for sushi or MOLLUSCAN SHELLFISH, or other raw READY-TO-EAT FOOD such as fruits and vegetables,(P) and\r\n(b) Cooked READY-TO-EAT FOOD; (P)\r\n(c) Frozen, commercially processed and packaged raw animal FOOD may be          stored or displayed with or above frozen, commercially processed and           packaged, ready-to-eat food.\r\n(2) Except when combined as ingredients, separating types of raw animal FOODS    from each other such as beef, FISH, lamb, pork, and POULTRY during storage,        preparation, holding, and display by:\r\n(a) Using separate EQUIPMENT for each type, (P) or\r\n(b) Arranging each type of FOOD in EQUIPMENT so that cross contamination of one type with another is prevented, (P) and\r\n(c) Preparing each type of FOOD at different times or in separate areas; (P)\r\n","violationType":"Priority","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2017-02-15T00:00:00","correctionDescription":null},{"violationCode":"4-601.11","violationDescription":"(A) EQUIPMENT FOOD-CONTACT SURFACES and UTENSILS shall be clean to sight and touch. (Pf)\r\n(B) The FOOD-CONTACT SURFACES of cooking EQUIPMENT and pans shall be kept free of encrusted grease deposits and other soil accumulations. \r\n(C) NonFOOD-CONTACT SURFACES of EQUIPMENT shall be kept free of an accumulation of dust, dirt, FOOD residue, and other debris. \r\n","violationType":"Foundation","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":null},{"violationCode":"4-302.14","violationDescription":"A test kit or other device that accurately measures the concentration in mg/L of SANITIZING solutions shall be provided. (Pf)\r\n","violationType":"Foundation","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"No","daysToCorrect":"10.0","correctedDate":null,"correctionDescription":null},{"violationCode":"3-305.11","violationDescription":"FOOD shall be protected from contamination by storing the FOOD:\r\n(1)     In a clean, dry location;\r\n(2)     Where it is not exposed to splash, dust, or other contamination; and\r\n(3)     At least 15 cm (6 inches) above the floor, unless otherwise approved.\r\n","violationType":"Core","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":null},{"violationCode":"MFL289.2129","violationDescription":"Sec. 2129. (1) All of the following food establishments shall employ a minimum of 1 managerial employee who is currently certified under a personnel certification program accredited by the American national standards institute, utilizing the conference for food protection standards:  (a) A food service establishment that is not any of the following:    (i) Operating under a temporary food service establishment license.  (ii) A vending machine location.     (b) An extended retail food establishment.  (c) Operated within a retail grocery.  (2) An individual certified under subsection (1) shall be recognized with full faith and credit by the state and all local units of government throughout the state.  (3) The department may promulgate rules to do all of the following:  (a) Develop requirements for retail food establishments to follow when employing certified food safety managers or personnel.  (b) Set a reasonable date for compliance with the requirements under subdivision (a) taking into consideration existing local personnel certification requirements.  (c) Establish certification fees necessary to implement, maintain, and track certified individuals directly or by contract. The department may annually adjust the schedule of fees to provide that the fee charged is sufficient to cover the cost of the certification tracking program.  (d) Implement and enforce the requirements described in subdivision (a).    (4) The certification program developed by the American national standards institute, as it exists on April 1, 2008 , is incorporated by reference. The department may adopt updates to the certification program accreditation standards in subsection (1) by rule.     (5) This section does not prohibit any local legislative body from implementing a food handler program, an employee health certification program, or a manager certification program, if it is not in conflict with this section.","violationType":"Core","itemDescription":null,"subItem":"","problemDescription":null,"subProblem":"","location":"KITCHEN","subLocation":"","corrected":"Not required","daysToCorrect":"30.0","correctedDate":null,"correctionDescription":null}]},{"inspectionid":"36124","inspectionDate":"2016-08-11T00:00:00","inspectionType":"Routine Inspection","inCompliance":"Yes","violationsByInspectionidList":[{"violationCode":"5-203.14","violationDescription":"A PLUMBING SYSTEM shall be installed to preclude backflow of contaminants into the water supply system at each point of use at the FOOD ESTABLISHMENT by providing an air gap or installing an APPROVED backflow prevention device. (P)\r\n","violationType":"Priority","itemDescription":"Backflow prevention","subItem":"Air gap","problemDescription":"Not provided","subProblem":"","location":"DISHWASHING AREA","subLocation":"At the Over head spray unit ","corrected":"Yes","daysToCorrect":"10.0","correctedDate":"2016-08-13T00:00:00","correctionDescription":"Provide air gap that is twice the diameter of the drain line and no less than 1 inch."}]}]}]}},"pageContext":{"eid":"1632"}}